20221211233726-php.org
:PROPERTIES:
:ID:       82360e75-76ce-4efa-aa24-f93adfce1f50
:END:
#+title: PHP
* 概要
PHPは[[id:868ac56a-2d42-48d7-ab7f-7047c85a8f39][Programming Language]]の1つ。Web開発でよく使われる。

- [[https://ja.wikipedia.org/wiki/PHP_(%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0%E8%A8%80%E8%AA%9E)][PHP (プログラミング言語) - Wikipedia]]

- PHPは[[id:df013984-822e-439c-bffd-06a5a67ff945][Nginx]]やApacheなどのWebサーバで実行される。これはあまりない。ほかの言語の場合は同じ言語で書かれたアプリケーションサーバを動かして、Webサーバからプロキシすることが多い
- PHPというときはプログラミング言語を意味する。PHPエンジンというときはPHPプログラムに書かれたコマンドに従ってWebページを生成するものを意味する
* Memo
* Tasks
** [[https://www.oreilly.co.jp/books/9784873117935/][O'Reilly Japan - 初めてのPHP]]
:LOGBOOK:
CLOCK: [2022-12-17 Sat 11:11]--[2022-12-17 Sat 11:36] =>  0:25
:END:
PHPの入門本。
* Reference
* Archives
