20221211233726-php.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PHP</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">PHP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4c515f">概要</a></li>
<li><a href="#org7b8e1a4">Memo</a></li>
<li><a href="#orgd076f54">Tasks</a>
<ul>
<li><a href="#orgd0e85ab">O&rsquo;Reilly Japan - 初めてのPHP</a></li>
</ul>
</li>
<li><a href="#org95741bd">Reference</a></li>
<li><a href="#org73ef13e">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga4c515f" class="outline-2">
<h2 id="orga4c515f"><a href="#orga4c515f">概要</a></h2>
<div class="outline-text-2" id="text-orga4c515f">
<p>
PHPは<a href="20210509101246-programming_language.html#ID-868ac56a-2d42-48d7-ab7f-7047c85a8f39">Programming Language</a>の1つ。Web開発でよく使われる。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/PHP_(%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0%E8%A8%80%E8%AA%9E)">PHP (プログラミング言語) - Wikipedia</a></li>

<li>PHPは<a href="20220414183922-nginx.html#ID-df013984-822e-439c-bffd-06a5a67ff945">Nginx</a>やApacheなどのWebサーバで実行される。これはあまりない。ほかの言語の場合は同じ言語で書かれたアプリケーションサーバを動かして、Webサーバからプロキシすることが多い</li>
<li>PHPというときはプログラミング言語を意味する。PHPエンジンというときはPHPプログラムに書かれたコマンドに従ってWebページを生成するものを意味する</li>
</ul>
</div>
</div>
<div id="outline-container-org7b8e1a4" class="outline-2">
<h2 id="org7b8e1a4"><a href="#org7b8e1a4">Memo</a></h2>
</div>
<div id="outline-container-orgd076f54" class="outline-2">
<h2 id="orgd076f54"><a href="#orgd076f54">Tasks</a></h2>
<div class="outline-text-2" id="text-orgd076f54">
</div>
<div id="outline-container-orgd0e85ab" class="outline-3">
<h3 id="orgd0e85ab"><a href="#orgd0e85ab"><a href="https://www.oreilly.co.jp/books/9784873117935/">O&rsquo;Reilly Japan - 初めてのPHP</a></a></h3>
<div class="outline-text-3" id="text-orgd0e85ab">
<p>
PHPの入門本。
</p>
</div>
</div>
</div>
<div id="outline-container-org95741bd" class="outline-2">
<h2 id="org95741bd"><a href="#org95741bd">Reference</a></h2>
</div>
<div id="outline-container-org73ef13e" class="outline-2">
<h2 id="org73ef13e"><a href="#org73ef13e">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
